app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @user = User.find(params[:id], :include => [:timesheets, :leave_requests])

INSERT INTO "users" ("name", "skeleton_hours", "comp_hours", "created_at", "vacation_hours", "sick_hours", "updated_at", "sick_accrual_rate", "vacation_accrual_rate", "login") VALUES('Keith Gaddis', 0.0, 0.0, '2009-02-09 03:46:16', 0.0, 0.0, '2009-02-09 03:46:16', 0.07, 0.05, 'keith')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save